tutorials/rasCavitatingFoam/throttle/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default              Euler;
}

interpolationSchemes
{
    default              linear;
}

divSchemes
{
    default              none;
    div(phiv,rho)        Gauss limitedLinear 0.2;
    div(phi,U)           Gauss limitedLinearV 0.2;
    div(phiv,omega)      Gauss limitedLinear 0.2;
    div(phiv,k)          Gauss limitedLinear 0.2;
}

gradSchemes
{
    default              Gauss linear;
}

laplacianSchemes
{
    default none;

    laplacian(nuf,rhoU)  Gauss linear corrected;
    laplacian(muEff,U)  Gauss linear corrected;
    laplacian(rrhoUAf,p) Gauss linear corrected;
    laplacian(rUAf,p)    Gauss linear corrected;
    laplacian(DomegaEff,omega) Gauss linear corrected;
    laplacian(DkEff,k)   Gauss linear corrected;

    laplacian(1,p)       Gauss linear corrected;
}

snGradSchemes
{
    default         none;
    snGrad(p)       corrected;
}

fluxRequired
{
    default        none;
    p;
    rho;
}

// ************************************************************************* //
